import type { FAQItem } from "~/types"

export const FAQ_ITEMS: FAQItem[] = [
    {
        question: "Какие способы оплаты доступны?",
        answer:
            "Вы можете оплатить банковской картой, через СБП или банковским переводом.",
    },
    {
        question: "Для кого наше приложение?",
        answer:
            "Наш сервис подходит всем, кому нужны иллюстрации без лишних сложностей. Будь вы дизайнер, маркетолог или просто человек, которому срочно нужен визуал — мы поможем.",
    },
    {
        question: "Можно ли использовать иллюстрации в коммерческих целях?",
        answer:
            "Да, иллюстрации, созданные по бесплатному плану, можно использовать в личных целях. Право коммерческого использования предоставляется только в платных тарифах.",
    },
    {
        question: "Есть ли бесплатный пробный период?",
        answer:
            "Да, мы предоставляем бесплатный пробный период с ограниченным количеством кредитов, чтобы вы могли опробовать сервис перед покупкой.",
    },
    {
        question: "Какие форматы файлов поддерживаются?",
        answer:
            "Сейчас доступны форматы PNG, JPEG и SVG. Во всех планах есть возможность экспорта векторных иллюстраций.",
    },
    {
        question: "Сколько времени занимает генерация иллюстрации?",
        answer:
            "Обычно генерация занимает от 10 до 30 секунд, в зависимости от сложности изображения.",
    },
    {
        question: "Можно ли отменить подписку?",
        answer:
            "Да, вы можете отменить подписку в любое время. Мы ценим гибкость, поэтому у нас действует политика «отмена в любой момент».",
    },
    {
        question: "Куда обращаться за помощью?",
        answer: "Если нужна поддержка, пишите нам на почту: support@example.com",
    },
] 